tutorials/heatTransfer/chtMultiRegionSimpleFoam/multiRegionHeaterRadiation/system/topAir/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

boundary
{
    ".*"
    {
        inGroups        2(wall viewFactorWall);
    }
}

U
{
    internalField   uniform (0.1 0 0);
    boundaryField
    {
        ".*"
        {
            type            fixedValue;
            value           uniform (0 0 0);
        }
        minX
        {
            type            fixedValue;
            value           uniform (0.1 0 0);
        }
        maxX
        {
            type            inletOutlet;
            inletValue      uniform (0 0 0);
            value           uniform (0.1 0 0);
        }
    }
}

T
{
    internalField   uniform 300;
    boundaryField
    {
        ".*"
        {
            type            zeroGradient;
        }

        minX
        {
            type            fixedValue;
            value           uniform 300;
        }
        maxX
        {
            type            inletOutlet;
            inletValue      uniform 300;
            value           uniform 300;
        }

        "topAir_to_.*"
        {
            type            compressible::turbulentTemperatureRadCoupledMixed;
            Tnbr            T;
            kappaMethod     fluidThermo;
            qrNbr           none;
            qr              qr;
            value           uniform 300;
        }
    }
}

epsilon
{
    internalField   uniform 0.01;
    boundaryField
    {
        ".*"
        {
            type            epsilonWallFunction;
            value           uniform 0.01;
        }

        minX
        {
            type            fixedValue;
            value           uniform 0.01;
        }
        maxX
        {
            type            inletOutlet;
            inletValue      uniform 0.01;
            value           uniform 0.01;
        }
    }
}

k
{
    internalField   uniform 0.1;
    boundaryField
    {
        ".*"
        {
            type            kqRWallFunction;
            value           uniform 0.1;
        }

        minX
        {
            type            fixedValue;
            value           uniform 0.1;
        }
        maxX
        {
            type            inletOutlet;
            inletValue      uniform 0.1;
            value           uniform 0.1;
        }
    }
}

p_rgh
{
    internalField   uniform 1e5;
    boundaryField
    {
        ".*"
        {
            type            fixedFluxPressure;
            value           uniform 1e5;
        }

        maxX
        {
            type            fixedValue;
            value           uniform 1e5;
        }
    }
}

p
{
    internalField   uniform 1e5;
    boundaryField
    {
        ".*"
        {
            type            calculated;
            value           uniform 1e5;
        }

        maxX
        {
            type            calculated;
            value           uniform 1e5;
        }
    }
}

qr
{
    internalField   uniform 0;
    boundaryField
    {
        ".*"
        {
            type            greyDiffusiveRadiationViewFactor;
            emissivityMode  lookup;
            qro             uniform 0;
            emissivity      uniform 1.0;
            value           uniform 0;
        }

        "topAir_to_.*"
        {
            type            greyDiffusiveRadiationViewFactor;
            emissivityMode  solidRadiation;
            qro             uniform 0;
            value           uniform 0;
        }
    }
}

G
{
    internalField   uniform 0;
    boundaryField
    {
        ".*"
        {
            type            MarshakRadiation;
            emissivityMode  lookup;
            emissivity      uniform 1.0;
            value           uniform 0;
        }

        "topAir_to_.*"
        {
            type            MarshakRadiation;
            emissivityMode  solidRadiation;
            value           uniform 0;
        }
    }
}

IDefault
{
    internalField   uniform 0;
    boundaryField
    {
        ".*"
        {
            type            greyDiffusiveRadiation;
            emissivityMode  lookup;
            emissivity      uniform 1.0;
            value           uniform 0;
        }

        "topAir_to_.*"
        {
            type            greyDiffusiveRadiation;
            emissivityMode  solidRadiation;
            value           uniform 0;
        }
    }
}

// ************************************************************************* //
